package com.dtl.gemini.kline.beans;

import com.dtl.gemini.kline.model.Depth;

import lombok.Getter;
import lombok.Setter;

/**
 * 合约指数信息
 *
 * @author DTL
 * @date 2020/5/19
 **/
@Getter
@Setter
public class DepthBean {
    /**
     * ch : market.BTC_CW.depth.step8
     * status : ok
     * tick : {"asks":[[9823.27,598],[9824.05,40],[9824.3,15],[9825.03,29],[9825.07,59],[9825.09,19],[9825.75,55],[9825.8,15],[9825.92,28],[9825.93,18],[9826.08,76],[9826.24,3],[9826.27,85],[9826.59,522],[9826.86,60],[9827.3,15],[9827.59,25],[9827.6,592],[9827.65,3],[9827.88,5]],"bids":[[9823.26,80],[9821.52,36],[9821.51,141],[9820.26,60],[9820.25,59],[9820.01,55],[9820,35],[9819.67,15],[9819.42,18],[9819.41,28],[9819.4,25],[9819.37,24],[9818.2,24],[9818.17,15],[9817.6,58],[9817.43,3],[9817.15,19],[9816.76,1],[9816.23,3],[9816.16,100]],"ch":"market.BTC_CW.depth.step8","id":1589877932,"mrid":68207126689,"ts":1589877932755,"version":1589877932}
     * ts : 1589877932776
     */

    private String ch;
    private String status;
    private Depth tick;
    /**
     * 时间戳，单位：毫秒
     */
    private long ts;
}
